# ElementsBelongToOtherSystem Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..SystemsFailures..::..ElementsBelongToOtherSystem Property
BuiltInFailures..::..SystemsFailures Class See Also
---
You have selected elements that are already part of other Systems that have assigned Equipment. The elements you selected cannot be added to this System.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId ElementsBelongToOtherSystem { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property ElementsBelongToOtherSystem As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ ElementsBelongToOtherSystem {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..SystemsFailures Class
Autodesk.Revit.DB Namespace